Repository: gitGNU/gnu_rawtools
Catalog: po/*.po
Languages: ru

source: Convert `float' stream into `uint8_t' one
ru: Преобразовывает float-поток в поток беззнаковых 8-битных целых

source: Copyright (C) 2006 Ivan Shmakov This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ru: Copyright (C) 2006 Ivan Shmakov Это свободная программа; подробности об условиях распространения смотрите в исходном тексте. НЕ предоставляется гарантий; даже гарантий КОММЕРЧЕСКОЙ ПРИГОДНОСТИ или ПРИГОДНОСТИ ДЛЯ КАКОЙ-ЛИБО ЦЕЛИ.

source: specifying the transformation table
ru: задание таблицы преобразования

source: append the contents of the file to the transformation table
ru: добавить содержимое файла к таблице преобразования

source: append ENTRY to the transformation table; ENTRY is a pair of floats separated by a comma
ru: добавить ENTRY к таблице преобразования; ENTRY должна состоять из двух действительных чисел, разделенных запятой

source: miscellaneous
ru: прочие параметры

source: select input format, which may be `float' (default) or `double'
ru: задать формат входных данных, может быть `float' (по-умолчанию), или `double'

source: use interpolation TYPE, which may be `none' (default) or `linear'
ru: использовать заданную интерполяцию, может быть `none' (по-умолчанию) или `linear'

source: output the result to this file instead of stdout
ru: выводить результат в файл, вместо стандартного вывода

source: explain what is being done
ru: пояснять, что будет сделано

source: invalid argument `%s' for `%s'; should be a float
ru: неверный аргумент `%s' для `%s'; должно быть число с плавающей точкой

source: couldn't handle file name `%s'
ru: не могу обработать имя файла `%s'

source: invalid entry `%s'; should be `FLOAT, FLOAT'
ru: неверный формат данных для таблицы `%s'; должен быть `ЧИСЛО, ЧИСЛО'

source: couldn't handle entry `%s'
ru: не могу обработать строку `%s'

source: invalid argument `%s' for `--interpolation'; should be `none' or `linear'
ru: неверный аргумент `%s' для `--interpolation'; должен быть `none' или `linear'

source: invalid argument `%s' for `--format'; should be `float' or `double'
ru: неверный аргумент `%s' для `--format'; должен быть `float' или `double'

source: couldn't store non-option arguments
ru: не могу сохранить обязательные аргументы

source: couldn't set stdin as the input file
ru: не могу указать стандартный ввод в качестве входного файла

source: couldn't allocate a transformation table
ru: не могу выделить память под таблицу преобразования

source: error parsing line%s
ru: ошибка разбора строки%s

source: : garbage found
ru: : несоответствие формату

source: processing standard input...
ru: обрабатывается стандартный ввод...

source: processing `%s'...
ru: обрабатывается `%s'...
